Ran Plan for 2 projects:

1. dir: `deployment/cloud` workspace: `default`
1. dir: `deployment/service/fta_users` workspace: `default`
---

### 1. dir: `deployment/cloud` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/cloud
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fcloud%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/cloud
  ```

---
### 2. dir: `deployment/service/fta_users` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_password.password will be created
+ resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 12
      + lower            = true
      + min_lower        = 3
      + min_numeric      = 3
      + min_special      = 0
      + min_upper        = 3
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.argocd_app.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = true
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fta-svc-users"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (sensitive value)
      + verify                     = false
      + version                    = "2.0.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.artifact_registry.google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + description            = "This is the repository for fta-svc-users service"
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "asia-southeast2"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "fta-platform"
      + repository_id          = "fta-svc-users"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-prerelease"

          + condition {
              + older_than            = "2592000s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "TAGGED"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-tagged-release"

          + condition {
              + package_name_prefixes = [
                  + "fta-svc-users",
                ]
              + tag_prefixes          = [
                  + "release",
                ]
              + tag_state             = "TAGGED"
              + version_name_prefixes = []
                # (2 unchanged attributes hidden)
            }
        }
      + cleanup_policies {
          + action = "KEEP"
          + id     = "keep-minimum-versions"

          + most_recent_versions {
              + keep_count            = 5
              + package_name_prefixes = [
                  + "fta-svc-users",
                ]
            }
        }
    }

  # module.gsa.google_project_iam_member.sa_iam[0] must be replaced
-/+ resource "google_project_iam_member" "sa_iam" {
      ~ etag    = "BwYiY5+2PKw=" -> (known after apply)
      ~ id      = "fta-platform/roles/storage.objectViewer/serviceAccount:fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.gsa.google_project_iam_member.sa_iam[1] must be replaced
-/+ resource "google_project_iam_member" "sa_iam" {
      ~ etag    = "BwYiY5+2PKw=" -> (known after apply)
      ~ id      = "fta-platform/roles/cloudsql.client/serviceAccount:fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" -> (known after apply)
      ~ member  = "serviceAccount:fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.gsa.google_service_account.gsa must be replaced
-/+ resource "google_service_account" "gsa" {
      ~ account_id   = "fta-dev-svc-users" -> "fta-svc-users" # forces replacement
      ~ display_name = "Service Account for fta-dev-svc-users service" -> "Service Account for fta-svc-users service"
      ~ email        = "fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" -> (known after apply)
      ~ id           = "projects/fta-platform/serviceAccounts/fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" -> (known after apply)
      ~ member       = "serviceAccount:fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" -> (known after apply)
      ~ name         = "projects/fta-platform/serviceAccounts/fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" -> (known after apply)
      ~ unique_id    = "116144283907582692656" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.gsa.google_service_account_iam_binding.binding[0] must be replaced
-/+ resource "google_service_account_iam_binding" "binding" {
      ~ etag               = "BwYiYOlUXTQ=" -> (known after apply)
      ~ id                 = "projects/fta-platform/serviceAccounts/fta-dev-svc-users@fta-platform.iam.gserviceaccount.com/roles/iam.workloadIdentityUser" -> (known after apply)
      ~ members            = [
          - "serviceAccount:fta-platform.svc.id.goog[dev/fta-dev-svc-users]",
          + "serviceAccount:fta-platform.svc.id.goog[dev/fta-svc-users]",
        ]
      ~ service_account_id = "projects/fta-platform/serviceAccounts/fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.gsa.google_service_account_iam_binding.binding[1] must be replaced
-/+ resource "google_service_account_iam_binding" "binding" {
      ~ etag               = "BwYiYOlUXTQ=" -> (known after apply)
      ~ id                 = "projects/fta-platform/serviceAccounts/fta-dev-svc-users@fta-platform.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator" -> (known after apply)
      ~ members            = [
          - "serviceAccount:fta-platform.svc.id.goog[dev/fta-dev-svc-users]",
          + "serviceAccount:fta-platform.svc.id.goog[dev/fta-svc-users]",
        ]
      ~ service_account_id = "projects/fta-platform/serviceAccounts/fta-dev-svc-users@fta-platform.iam.gserviceaccount.com" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.gsm.google_secret_manager_secret.secret will be created
+ resource "google_secret_manager_secret" "secret" {
      + annotations           = {
          + "code"    = "svc"
          + "env"     = "dev"
          + "feature" = "users"
          + "name"    = "fta-svc-users"
          + "unit"    = "fta"
        }
      + create_time           = (known after apply)
      + effective_annotations = {
          + "code"    = "svc"
          + "env"     = "dev"
          + "feature" = "users"
          + "name"    = "fta-svc-users"
          + "unit"    = "fta"
        }
      + effective_labels      = {
          + "code"                       = "svc"
          + "env"                        = "dev"
          + "feature"                    = "users"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "fta-svc-users"
          + "unit"                       = "fta"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + labels                = {
          + "code"    = "svc"
          + "env"     = "dev"
          + "feature" = "users"
          + "name"    = "fta-svc-users"
          + "unit"    = "fta"
        }
      + name                  = (known after apply)
      + project               = "fta-platform"
      + secret_id             = "users"
      + terraform_labels      = {
          + "code"                       = "svc"
          + "env"                        = "dev"
          + "feature"                    = "users"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "fta-svc-users"
          + "unit"                       = "fta"
        }

      + replication {
          + user_managed {
              + replicas {
                  + location = "asia-southeast2"
                }
            }
        }
    }

  # module.gsm.google_secret_manager_secret_version.secret_version will be created
+ resource "google_secret_manager_secret_version" "secret_version" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

  # module.sql.google_sql_database.database will be created
+ resource "google_sql_database" "database" {
      + charset         = "UTF8"
      + collation       = "en_US.UTF8"
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "fta-mstr-cloudsql-main"
      + name            = "fta_users"
      + project         = "fta-platform"
      + self_link       = (known after apply)
    }

  # module.sql.google_sql_user.user will be created
+ resource "google_sql_user" "user" {
      + host                    = (known after apply)
      + id                      = (known after apply)
      + instance                = "fta-mstr-cloudsql-main"
      + name                    = (sensitive value)
      + password                = (sensitive value)
      + project                 = "fta-platform"
      + sql_server_user_details = (known after apply)
    }

Plan: 12 to add, 0 to change, 5 to destroy.

Changes to Outputs:
+ artifact_repo_id      = (known after apply)
+ artifact_repo_name    = (known after apply)
+ service_account_email = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/service/fta_users
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fservice%252Ffta_users%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/service/fta_users
  ```
Plan: 12 to add, 0 to change, 5 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 1 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```